// The Invoke-DumpApps module assists in identifying app registrations. It will dump a list of Azure app registrations from the tenant, 
// including permission scopes and users that have consented to the apps. Additionally, it will list external apps that are not owned by the current 
// tenant or by Microsoft’s main app tenant. This is a way to find third-party external apps that users may have consented to. The execution of this module 
// results in a significant amount of events, as shown in the below screenshot.

let InvokeDumpAppsCalls = dynamic(["https://graph.microsoft.com/v1.0/users/"
    , "https://graph.microsoft.com/v1.0/organization" ,"https://graph.microsoft.com/v1.0/applications"
    ,"https://graph.microsoft.com/v1.0/servicePrincipals/",'https://graph.microsoft.com/v1.0/servicePrincipals?$skiptoken="']);
MicrosoftGraphActivityLogs
| where UserAgent contains "PowerShell"
| where RequestUri in~ (InvokeDumpAppsCalls) 
    or RequestUri has_all("https://graph.microsoft.com/v1.0/servicePrincipals(appId=", "appRoleAssignedTo")
| join kind = leftouter AADNonInteractiveUserSignInLogs 
    on $left.SignInActivityId == $right.UniqueTokenIdentifier
| extend RequestedAppId = extract(@"appId='(.*?)'", 1, RequestUri)

