id: ccab86ce-c2f1-4903-a4f5-2d309fe77950
name: Malicious Mailbox Rules (BEC)
description: |
  'This rule searches for potentially malicious mailbox actions that could indicate email compromise. Typical adversary tactics include the creation of new inbox rules to divert incoming emails to default but underused mail folders. If a rule has been created which moves emails to one of the folders ("Archive", "RSS Feeds", "RSS Subscriptions", "Deleted", "Conversation History") and sets MarkedAsRead property'
severity: High
status: Available
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
  - Collection
relevantTechniques:
  - T1098
  - T1114
query: |
  let RuleEvents = dynamic(["New-InboxRule", "Set-InboxRule", "Remove-InboxRule", "Disable-InboxRule", "UpdateInBoxRules", "Set-Mailbox"]);
  // Malicous Folder
  let RuleParams = dynamic(["Archive", "RSS Feeds", "RSS Subscriptions", "Deleted", "Conversation History"]);
  OfficeActivity
  | where TimeGenerated > ago(1d)
  | where OfficeWorkload =~ "Exchange"
  | where Operation in~ (RuleEvents) and Parameters has_any(RuleParams)
  // Extracting parameters column to display details of detected mailbox rule
  | extend MailboxRuleConcat = strcat(
      tostring(parse_json(Parameters)[0].Name), ": ", tostring(parse_json(Parameters)[0].Value), " | "
      , tostring(parse_json(Parameters)[2].Name), ": ", tostring(parse_json(Parameters)[2].Value), " | "
      , tostring(parse_json(Parameters)[4].Name), ": ", tostring(parse_json(Parameters)[4].Value), " | "
      , tostring(parse_json(Parameters)[5].Name), ": ", tostring(parse_json(Parameters)[5].Value), " | "
      , tostring(parse_json(Parameters)[6].Name), ": ", tostring(parse_json(Parameters)[6].Value)
      )
  | extend MailboxRule = split(MailboxRuleConcat, "|")
  | project 
      TimeGenerated
      , UserId
      , ClientIP 
      , MailboxRule
      , Operation
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: UserId
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ClientIP
version: 1.0.0
kind: Scheduled
