id: 1f2ea7ad-5572-45f0-af5d-3be6b554ebe1
name: SharePointFileOperation via devices with previously unseen user agents
description: |
  'Identifies if the number of documents uploaded or downloaded from device(s) associated
  with a previously unseen user agent exceeding a threshold of 20'
severity: Medium
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: P1D
queryPeriod: P8D
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Exfiltration
relevantTechniques:
  - T1030
query: |
  let threshold = 20;
  let szSharePointFileOperation = "SharePointFileOperation";
  let szOperations = dynamic(["FileDownloaded", "FileUploaded"]);
  let starttime = 8d;
  let endtime = 1d;
  let historicalActivity =
      OfficeActivity
      | where TimeGenerated between(ago(starttime)..ago(endtime))
      | where RecordType =~ szSharePointFileOperation
      | where Operation in~ (szOperations)
      | where isnotempty(UserAgent)
      | summarize historicalCount = count() 
          by UserAgent, RecordType, Operation
      ;
  let recentActivity = 
      OfficeActivity
      | where TimeGenerated > ago(endtime)
      | where RecordType =~ szSharePointFileOperation
      | where Operation in~ (szOperations)
      | where isnotempty(UserAgent)
      | summarize recentCount = count() 
          by UserAgent, RecordType, Operation
      ;
  let RareUserAgent = 
      recentActivity 
      | join kind = leftanti (historicalActivity) 
          on UserAgent
      | order by recentCount desc, UserAgent
      // More than 5 downloads/uploads from a new user agent today
      | where recentCount > threshold
      ;
  OfficeActivity
  | where TimeGenerated > ago(endtime)
  | where RecordType =~ szSharePointFileOperation
  | where Operation in~ (szOperations)
  | where isnotempty(UserAgent)
  | join kind= inner (RareUserAgent)
      on UserAgent, RecordType, Operation
  | summarize StartTime = min(TimeGenerated)
      , EndTime = max(TimeGenerated)
      , OfficeObjectIdCount = dcount(OfficeObjectId)
      , OfficeObjectIdList = make_set(OfficeObjectId) 
      by RecordType, Operation, UserAgent, UserType, UserId, ClientIP
      , OfficeWorkload, Site_Url, UserAgentSeenCount = recentCount
  | extend UserIdName = tostring(split(UserId, '@')[0]), UserIdUPNSuffix = tostring(split(UserId, '@')[1])
  | project-reorder StartTime, EndTime, UserAgent, UserAgentSeenCount, UserId, ClientIP, Site_Url
  | order by UserAgentSeenCount desc, UserAgent asc, UserId asc, Site_Url asc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: Name
        columnName: UserIdName
      - identifier: UPNSuffix
        columnName: UserIdUPNSuffix
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ClientIP
  - entityType: URL
    fieldMappings:
      - identifier: Url
        columnName: Site_Url
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
suppressionDuration: PT5H
suppressionEnabled: false
version: 1.0.0
kind: Scheduled
