id: 836e2f4b-6a9d-4a73-a062-34fa47030121
name: Activity from known suspicious user
description: |
  'Please escalate this incident to Tier 3 / SOC Manager
  
  REQUIRES WATCHLIST = "SuspiciousUsers"'
severity: Medium
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Reconnaissance
  - InitialAccess
  - Persistence
relevantTechniques:
  - T1591
  - T1078
query: |
  let SuspiciousUsers = _GetWatchlist('SuspiciousUsers') | project UserPrincipalName = SearchKey;
  let O365Activity = 
      OfficeActivity
      | extend UserPrincipalName = UserId
      | where UserPrincipalName in (SuspiciousUsers)
      | extend Appname = 
          iff(tostring(split(OfficeObjectId, '/')[3]) == 'personal', 'Onedrive for Business'
          , iff(tostring(split(OfficeObjectId, '/')[3]) == 'sites', 'SharePoint'
          , 'Brand Assets'))
      | extend UserLocation = tostring(split(OfficeObjectId, '/')[4])
      | extend DocumentName = extract(@'[^\\/:*?"<>|\r\n]+$', 0, OfficeObjectId)
      | where isnotempty(DocumentName)
      | summarize by UserPrincipalName, Appname, UserLocation, DocumentName;
  let SuspiciousLogin =
      SigninLogs
      | where UserPrincipalName in (SuspiciousUsers)
      | where ResultType == 0
      | extend DeviceType = tostring(DeviceDetail.name)
      | extend DeviceTrust = tostring(DeviceDetail.trustType)
      | extend DeviceOS = tostring(DeviceDetail.operatingSystem)
      | where isnotempty(DeviceType)
      | summarize by UserPrincipalName, DeviceType, DeviceTrust, DeviceOS
      ;
  union O365Activity, SuspiciousLogin
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: Name
    columnName: UserPrincipalName
- entityType: CloudApplication
  fieldMappings:
  - identifier: Name
    columnName: Appname
- entityType: Host
  fieldMappings:
  - identifier: HostName
    columnName: DeviceType
suppressionDuration: 5h
suppressionEnabled: false
version: 1.0.0
kind: Scheduled