id: 7bfdf8f9-237e-4c44-be98-ea3d751edcd2
name: Bumblebee stings with ransomware - Living-off-the-land-binary technique for DLL execution
description: |
  'https://security.microsoft.com/threatanalytics3/048e866a-0a92-47b8-94ac-c47fe577cc33/analystreport?tid=ecdddbca-fce0-4812-91fc-ab27516b33fb

  Looks for command line utilized for execution of rsp file which leads to execution of DLL using regsvr32. Here adversaries abuse odbcconf.exe to bypass application control solutions for DLL execution'
severity: High
requiredDataConnectors:
  - connectorId: MicrosoftDefenderforEndpoints
    dataTypes:
      - DeviceProcessEvents
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - Persistence
  - DefenseEvasion
  - LateralMovement
relevantTechniques:
  - T1569
  - T1554
  - T1211
  - T0843
query: |
  DeviceProcessEvents
  | where ProcessCommandLine has_all ("odbcconf",".rsp","-f")
entityMappings:
  - entityType: Process
    fieldMappings:
      - identifier: CommandLine
        columnName: ProcessCommandLine
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
suppressionDuration: PT5H
suppressionEnabled: false
version: 1.0.0
kind: Scheduled
