id: daffa96a-0955-464a-b858-09928333ad28
name: Bumblebee stings with ransomware - Malicious export functions in Bumblebee DLL
description: |
  'https://security.microsoft.com/threatanalytics3/048e866a-0a92-47b8-94ac-c47fe577cc33/analystreport?tid=ecdddbca-fce0-4812-91fc-ab27516b33fb

  Look for command line which contains malicious export functions as listed in query – this is a list of observed exports at time of writing and may change over time.'
severity: High
requiredDataConnectors:
  - connectorId: MicrosoftDefenderforEndpoints
    dataTypes:
      - DeviceFileEvents
      - DeviceProcessEvents
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Execution
  - Persistence
  - DefenseEvasion
  - LateralMovement
relevantTechniques:
  - T1569
  - T1554
  - T1211
  - T0843
query: |
  union DeviceFileEvents, DeviceProcessEvents
  | where ProcessCommandLine has_any ("juwXYebIfE", "LeKGTMwkFQ", "dSjXqiVvQK", "SjVjlixjPb", "MDbJvVaNCR", "EPTsswwiRJ", "IternalJob", "YTBSBbNTWU", "AUjoZKdcSZ", "xshiMECwuG", "rBgTBiTTDW", "EUQtIMIQqE", "shjKeAQfgT", "zYKGjAgZov", "pGUAYVFxbN", "VcrbRMwpuk", "ZmJwfQQnqA", "zYKGjAgZov", "kXlNkCKgFC")
entityMappings:
  - entityType: Process
    fieldMappings:
      - identifier: CommandLine
        columnName: ProcessCommandLine
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
suppressionDuration: PT5H
suppressionEnabled: false
version: 1.0.0
kind: Scheduled
