id: 63b63b36-9530-41d2-8f31-b435e99eb66d
name: New Source added to DCR
description: Detects when a new source is added to a Data Collection Rule (DCR)
severity: Informational
requiredDataConnectors:
  - connectorId: AzureActivity
    dataTypes:
      - AzureActivity
queryFrequency: PT5H
queryPeriod: PT5H
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Impact
query: |
  AzureActivity
  | where OperationNameValue has "DATACOLLECTIONRULEASSOCIATIONS/WRITE"
      and ActivitySubstatusValue has "OK"
  | extend Resources = split(tostring(Properties_d.resource), "/")
  | extend Source = toupper(Resources[0])
  | extend SourceRG = tostring(Properties_d.resourceGroup)
  | extend DCR = toupper(split(Resources[2], "-association")[0])
  | summarize by format_datetime(bin(TimeGenerated, 1d), "dd/MM/yyyy") , Source, SourceRG, DCR, Caller, CallerIpAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: CallerIpAddress
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: CallerIpAddress
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: Source
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
suppressionDuration: P1D
suppressionEnabled: true
version: 1.0.0
kind: Scheduled
